src/pages/guilda-ia/07-ferramentas-multiplas.org
#+TITLE: Múltiplas Ferramentas e MCP: O Agente Se Expande
# Semana 7 - 12/06/2026
#+DESCRIPTION: Semana 7 - Guilda de IA: Múltiplas ferramentas, debug, descrições, MCP e async
#+SETUPFILE: ./setupfile.org
#+LANGUAGE: pt_BR
#+STARTUP: inlineimages showall latexpreview
#+DATE: 12/06/2026

* Chamadas encadeadas

Na semana passada, o agente usava uma ferramenta por vez. Mas e quando a pergunta precisa de *duas ou mais*?

Exemplo: "Quanto é 234 × 987 + 100?"

#+BEGIN_SRC text
Thought: Preciso multiplicar 234 × 987, depois somar 100
Action: calculate(234, 987, "multiply") → 230958
Action: calculate(230958, 100, "add") → 231058
Answer: "O resultado é 231.058."
#+END_SRC

O =create_agent= faz isso *automaticamente*. Ele repete o ciclo Thought→Action→Observation até ter a resposta final.

#+BEGIN_SRC python
from langchain.agents import create_agent

agente = create_agent(llm, [calculate, get_time, get_word_length])

resultado = agente.invoke({"messages": "Quanto é 234 vezes 987 mais 100?"})
print(resultado["messages"][-1].content)
# "O resultado de 234 × 987 + 100 é 231.058."
#+END_SRC

O agente decide sozinho: preciso de duas chamadas a =calculate=? Então faço duas.

* O problema das descrições vagas

Se duas ferramentas parecem fazer a mesma coisa, o modelo confunde.

** Exemplo de conflito:

#+BEGIN_SRC python
@tool
def search_wiki(query: str) -> str:
    """Search for information."""
    ...

@tool
def search_web(query: str) -> str:
    """Search for information."""
    ...
#+END_SRC

Duas ferramentas com a mesma descrição genérica. O LLM não sabe qual usar.

** Solução: descrições específicas

#+BEGIN_SRC python
@tool
def search_wiki(query: str) -> str:
    """Search Wikipedia for factual, historical, and encyclopedic information.
    Use for established facts about people, places, events, and concepts.
    """
    ...

@tool
def search_web(query: str) -> str:
    """Search the web for current information like news, prices, and recent events.
    Use for real-time data that changes frequently.
    """
    ...
#+END_SRC

Agora o modelo distingue: fato histórico → =search_wiki=, notícia atual → =search_web=.

** Regra prática: cada ferramenta precisa de uma descrição exclusiva que explique *quando* usar.

* Debug de ferramentas

O LLM nem sempre acerta. Eis os problemas mais comuns e como resolver.

** Problema 1: LLM chama a ferramenta errada

Pergunta: "Que horas são?"
LLM chama: =calculate= em vez de =get_time=

*Causa:* descrição de =calculate= muito vaga ("Faz cálculos") ou descrição de =get_time= não menciona "que horas são".

*Solução:* melhorar a descrição da ferramenta correta.

#+BEGIN_SRC python
# ❌ Vaga
@tool
def get_time() -> str:
    """Returns current date and time."""

# ✅ Específica
@tool
def get_time() -> str:
    """Returns the current date and time.
    Use when the user asks 'what time is it', 'what date is today',
    or any question about the current moment.
    """
#+END_SRC

** Problema 2: argumentos errados

LLM manda: =calculate(a=234, b=987, operation="234 vezes 987")=
Esperado: =operation= deve ser ="multiply"=, não ="234 vezes 987"=

*Causa:* descrição do parâmetro =operation= não lista os valores possíveis claramente.

*Solução:* documentar valores permitidos no docstring.

#+BEGIN_SRC python
@tool
def calculate(a: float, b: float, operation: str) -> float:
    """Performs a mathematical operation between two numbers.
    Use when you need to perform numeric calculations.

    Args:
        a: First number
        b: Second number
        operation: One of 'add', 'subtract', 'multiply', 'divide'
    """
#+END_SRC

** Problema 3: ValidationError

Se o LLM manda um argumento com tipo errado (ex: passar texto onde espera número), Pydantic gera um *ValidationError* com contexto claro.

#+BEGIN_SRC python
# ValidationError: Input should be a valid number,
# unable to parse string as a number (field: a)
#+END_SRC

Isso é *bom* — o agente recebe o erro e pode corrigir. Mas se acontece muito, a descrição do parâmetro pode estar confusa.

