pages/guilda-ia/07-ferramentas-multiplas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt_BR" xml:lang="pt_BR">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Múltiplas Ferramentas e MCP: O Agente Se Expande</title>
<meta name="author" content="Lucas S. Vieira" />
<meta name="description" content="Semana 7 - Guilda de IA: Múltiplas ferramentas, debug, descrições, MCP e async
Material didático do curso de IA Generativa da Guilda de IA" />
<meta name="generator" content="Org Mode" />
<!-- Google tag (gtag.js) -->
<link rel="stylesheet" type="text/css" href="/css/main.css" />
<link rel="stylesheet" type="text/css" href="/css/syntax.css" />
<link id="theme-css" rel="stylesheet" type="text/css" href="/css/dark-theme.css" />
<link rel="icon" type="image/jpg" href="/img/cat-i-mage.jpg" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta name="theme-color" content="#14171e">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.4.0/css/all.min.css">
<meta property="og:url" content="https://luksamuk.codes/pages/guilda-ia/07-ferramentas-multiplas.html">
<meta property="og:type" content="website">
<meta property="og:title" content="Múltiplas Ferramentas e MCP: O Agente Se Expande">
<meta property="og:description" content="Semana 7 - Guilda de IA: Múltiplas ferramentas, debug, descrições, MCP e async
Material didático do curso de IA Generativa da Guilda de IA">
<meta property="og:image" content="https://luksamuk.codes/img/banner-full.png">
<meta name="twitter:card" content="summary_large_image">
<meta name="twitter:domain" content="luksamuk.codes">
<meta name="twitter:url" content="https://luksamuk.codes/pages/guilda-ia/07-ferramentas-multiplas.html">
<meta name="twitter:title" content="Múltiplas Ferramentas e MCP: O Agente Se Expande">
<meta name="twitter:description" content="Semana 7 - Guilda de IA: Múltiplas ferramentas, debug, descrições, MCP e async
Material didático do curso de IA Generativa da Guilda de IA">
<meta name="twitter:image" content="https://luksamuk.codes/img/banner.png">
</head>
<body>
<div id="preamble" class="status">
<div id="nav-wrapper"><nav id="site-nav"><a href="/"><i class="fa-solid fa-house"></i> Home</a> <a href="/pages/about.html"><i class="fa-solid fa-user"></i> About</a> <a href="/pages/games.html"><i class="fa-solid fa-gamepad"></i> Games</a> <a href="/pages/portfolio.html"><i class="fa-solid fa-briefcase"></i> Portfolio</a> <a href="/pages/learn.html"><i class="fa-solid fa-book-open"></i> Learn</a> <a href="/pages/talks-index.html"><i class="fa-solid fa-chalkboard-user"></i> Talks</a> <a href="/pages/blog.html"><i class="fa-solid fa-rss"></i> Blog</a> <button id="theme-selector" onclick="toggleTheme()"><i class="fa-solid fa-moon"></i></button></nav><h1 class="site-title"><a href="/">The Alchemist's Hideout</a></h1></div><h1 class="title">Múltiplas Ferramentas e MCP: O Agente Se Expande</h1>
</div>
<div id="content" class="content">
<div id="outline-container-org97803a8" class="outline-2">
<h2 id="org97803a8">Chamadas encadeadas</h2>
<div class="outline-text-2" id="text-org97803a8">
<p>
Na semana passada, o agente usava uma ferramenta por vez. Mas e quando a pergunta precisa de <b>duas ou mais</b>?
</p>

<p>
Exemplo: "Quanto é 234 × 987 + 100?"
</p>

<div class="org-src-container">
<pre class="src src-text">Thought: Preciso multiplicar 234 &#215; 987, depois somar 100
Action: calculate(234, 987, "multiply") &#8594; 230958
Action: calculate(230958, 100, "add") &#8594; 231058
Answer: "O resultado &#233; 231.058."
</pre>
</div>

<p>
O <code>create_agent</code> faz isso <b>automaticamente</b>. Ele repete o ciclo Thought→Action→Observation até ter a resposta final.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">from</span> langchain.agents <span class="org-keyword">import</span> create_agent

<span class="org-variable-name">agente</span> <span class="org-operator">=</span> create_agent(llm, [calculate, get_time, get_word_length])

<span class="org-variable-name">resultado</span> <span class="org-operator">=</span> agente.invoke({<span class="org-string">"messages"</span>: <span class="org-string">"Quanto &#233; 234 vezes 987 mais 100?"</span>})
<span class="org-builtin">print</span>(resultado[<span class="org-string">"messages"</span>][<span class="org-operator">-</span>1].content)
<span class="org-comment-delimiter"># </span><span class="org-comment">"O resultado de 234 &#215; 987 + 100 &#233; 231.058."</span>
</pre>
</div>

<p>
O agente decide sozinho: preciso de duas chamadas a <code>calculate</code>? Então faço duas.
</p>
</div>
</div>
<div id="outline-container-org34c30ca" class="outline-2">
<h2 id="org34c30ca">O problema das descrições vagas</h2>
<div class="outline-text-2" id="text-org34c30ca">
<p>
Se duas ferramentas parecem fazer a mesma coisa, o modelo confunde.
</p>
</div>
<div id="outline-container-org5e488df" class="outline-3">
<h3 id="org5e488df">Exemplo de conflito:</h3>
<div class="outline-text-3" id="text-org5e488df">
<div class="org-src-container">
<pre class="src src-python"><span class="org-type">@tool</span>
<span class="org-keyword">def</span> <span class="org-function-name">search_wiki</span>(query: <span class="org-builtin">str</span>) <span class="org-operator">-&gt;</span> <span class="org-builtin">str</span>:
    <span class="org-doc">"""Search for information."""</span>
    ...

<span class="org-type">@tool</span>
<span class="org-keyword">def</span> <span class="org-function-name">search_web</span>(query: <span class="org-builtin">str</span>) <span class="org-operator">-&gt;</span> <span class="org-builtin">str</span>:
    <span class="org-doc">"""Search for information."""</span>
    ...
</pre>
</div>

<p>
Duas ferramentas com a mesma descrição genérica. O LLM não sabe qual usar.
</p>
</div>
</div>
<div id="outline-container-org2c2e903" class="outline-3">
<h3 id="org2c2e903">Solução: descrições específicas</h3>
<div class="outline-text-3" id="text-org2c2e903">
<div class="org-src-container">
<pre class="src src-python"><span class="org-type">@tool</span>
<span class="org-keyword">def</span> <span class="org-function-name">search_wiki</span>(query: <span class="org-builtin">str</span>) <span class="org-operator">-&gt;</span> <span class="org-builtin">str</span>:
    <span class="org-doc">"""Search Wikipedia for factual, historical, and encyclopedic information.
    Use for established facts about people, places, events, and concepts.
    """</span>
    ...

<span class="org-type">@tool</span>
<span class="org-keyword">def</span> <span class="org-function-name">search_web</span>(query: <span class="org-builtin">str</span>) <span class="org-operator">-&gt;</span> <span class="org-builtin">str</span>:
    <span class="org-doc">"""Search the web for current information like news, prices, and recent events.
    Use for real-time data that changes frequently.
    """</span>
    ...
</pre>
</div>

<p>
Agora o modelo distingue: fato histórico → <code>search_wiki</code>, notícia atual → <code>search_web</code>.
</p>
</div>
</div>
<div id="outline-container-org3899abd" class="outline-3">
<h3 id="org3899abd">Regra prática: cada ferramenta precisa de uma descrição exclusiva que explique <b>quando</b> usar.</h3>
</div>
</div>
<div id="outline-container-org23d6ced" class="outline-2">
<h2 id="org23d6ced">Debug de ferramentas</h2>
<div class="outline-text-2" id="text-org23d6ced">
<p>
O LLM nem sempre acerta. Eis os problemas mais comuns e como resolver.
</p>
</div>
<div id="outline-container-orgfb5f611" class="outline-3">
<h3 id="orgfb5f611">Problema 1: LLM chama a ferramenta errada</h3>
<div class="outline-text-3" id="text-orgfb5f611">
<p>
Pergunta: "Que horas são?"
LLM chama: <code>calculate</code> em vez de <code>get_time</code>
</p>

<p>
<b>Causa:</b> descrição de <code>calculate</code> muito vaga ("Faz cálculos") ou descrição de <code>get_time</code> não menciona "que horas são".
</p>

<p>
<b>Solução:</b> melhorar a descrição da ferramenta correta.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-comment-delimiter"># </span><span class="org-comment">&#10060; Vaga
</span><span class="org-type">@tool</span>
<span class="org-keyword">def</span> <span class="org-function-name">get_time</span>() <span class="org-operator">-&gt;</span> <span class="org-builtin">str</span>:
    <span class="org-doc">"""Returns current date and time."""</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">&#9989; Espec&#237;fica
</span><span class="org-type">@tool</span>
<span class="org-keyword">def</span> <span class="org-function-name">get_time</span>() <span class="org-operator">-&gt;</span> <span class="org-builtin">str</span>:
    <span class="org-doc">"""Returns the current date and time.
    Use when the user asks 'what time is it', 'what date is today',
    or any question about the current moment.
    """</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7874730" class="outline-3">
<h3 id="org7874730">Problema 2: argumentos errados</h3>
<div class="outline-text-3" id="text-org7874730">
<p>
LLM manda: <code>calculate(a=234, b=987, operation</code>"234 vezes 987")=
Esperado: <code>operation</code> deve ser <code>"multiply"</code>, não <code>"234 vezes 987"</code>
</p>

<p>
<b>Causa:</b> descrição do parâmetro <code>operation</code> não lista os valores possíveis claramente.
</p>

<p>
<b>Solução:</b> documentar valores permitidos no docstring.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-type">@tool</span>
<span class="org-keyword">def</span> <span class="org-function-name">calculate</span>(a: <span class="org-builtin">float</span>, b: <span class="org-builtin">float</span>, operation: <span class="org-builtin">str</span>) <span class="org-operator">-&gt;</span> <span class="org-builtin">float</span>:
    <span class="org-doc">"""Performs a mathematical operation between two numbers.
    Use when you need to perform numeric calculations.

    Args:
        a: First number
        b: Second number
        operation: One of 'add', 'subtract', 'multiply', 'divide'
    """</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc26aa58" class="outline-3">
<h3 id="orgc26aa58">Problema 3: ValidationError</h3>
<div class="outline-text-3" id="text-orgc26aa58">
<p>
Se o LLM manda um argumento com tipo errado (ex: passar texto onde espera número), Pydantic gera um <b>ValidationError</b> com contexto claro.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-comment-delimiter"># </span><span class="org-comment">ValidationError: Input should be a valid number,
</span><span class="org-comment-delimiter"># </span><span class="org-comment">unable to parse string as a number (field: a)</span>
</pre>
</div>

<p>
Isso é <b>bom</b> — o agente recebe o erro e pode corrigir. Mas se acontece muito, a descrição do parâmetro pode estar confusa.
</p>
</div>
</div>
</div>
