src/pages/guilda-ia/07-ferramentas-multiplas.org
* Ferramentas externas via MCP

Até agora, você escreveu as ferramentas. Mas e se *outra pessoa* escreveu a ferramenta e você só quer usar?

O **MCP** (Model Context Protocol) é um protocolo padrão para ferramentas. Pense nele como o HTTP das ferramentas de IA — assim como HTTP padronizou a web, MCP padroniza como ferramentas se conectam a agentes.

** Conceito

[[https://modelcontextprotocol.io/][Model Context Protocol]] (criado pela Anthropic, open-source):
- Um *servidor MCP* expõe ferramentas
- Um *cliente MCP* consome essas ferramentas
- Protocolo padrão — qualquer LLM pode se conectar a qualquer servidor MCP

Na S06, você escreveu as ferramentas com =@tool=. Na S07, você *consome* ferramentas que alguém escreveu, via MCP.

** Servidor MCP com FastMCP

Vamos criar um servidor MCP simples — depois vamos consumi-lo como cliente.

#+BEGIN_SRC python
# math_server.py — Servidor MCP com duas ferramentas
from mcp.server.fastmcp import FastMCP

mcp = FastMCP("Math")

@mcp.tool()
def add(a: int, b: int) -> int:
    """Add two numbers together."""
    return a + b

@mcp.tool()
def multiply(a: int, b: int) -> int:
    """Multiply two numbers together."""
    return a * b

if __name__ == "__main__":
    mcp.run(transport="stdio")
#+END_SRC

Repare: é quase idêntico ao =@tool= do LangChain, mas com =@mcp.tool()= e =FastMCP= em vez de =langchain_core.tools=.

O servidor usa ~transport="stdio"~ — roda no mesmo processo, sem servidor externo.

** Cliente: consumindo MCP no LangChain

Instale: =pip install langchain-mcp-adapters=

#+BEGIN_SRC python
from mcp import ClientSession, StdioServerParameters
from mcp.client.stdio import stdio_client
from langchain_mcp_adapters.tools import load_mcp_tools
from langchain.agents import create_agent

server_params = StdioServerParameters(
    command="python",
    args=["math_server.py"],
)

async with stdio_client(server_params) as (read, write):
    async with ClientSession(read, write) as session:
        await session.initialize()
        tools = await load_mcp_tools(session)
        # tools agora são @tool do LangChain — usa igual!
        agente = create_agent(llm, tools)
        resultado = await agente.ainvoke(
            {"messages": "Quanto é 3 + 5 multiplicado por 2?"}
        )
        print(resultado["messages"][-1].content)
#+END_SRC

O que aconteceu:
1. =stdio_client= iniciou o servidor =math_server.py= em background
2. =ClientSession= fez o handshake MCP
3. =load_mcp_tools= converteu as ferramentas MCP em =@tool= do LangChain
4. =create_agent= usou as ferramentas normalmente — igual à S06

** Servidor MCP remoto (HTTP)

O exemplo acima usa ~transport="stdio"~ — o cliente spawn o servidor localmente. Mas o MCP também suporta transporte HTTP, permitindo conectar a servidores remotos.

Para rodar o mesmo servidor como HTTP:

#+BEGIN_SRC python
# math_server_http.py — Mesmo servidor, mas acessível via HTTP
from mcp.server.fastmcp import FastMCP

mcp = FastMCP("Math")

@mcp.tool()
def add(a: int, b: int) -> int:
    """Add two numbers together."""
    return a + b

@mcp.tool()
def multiply(a: int, b: int) -> int:
    """Multiply two numbers together."""
    return a * b

# Roda em http://localhost:8000 (ou qualquer host remoto)
mcp.run(transport="streamable-http")
#+END_SRC

O código do servidor é idêntico — só muda a última linha. O servidor fica disponível em =http://localhost:8000/mcp= e pode ser acessado de qualquer máquina com conectividade.

** Cliente remoto (HTTP)

No cliente, em vez de =stdio_client=, usamos =streamablehttp_client= com uma URL:

#+BEGIN_SRC python
from mcp import ClientSession
from mcp.client.streamable_http import streamablehttp_client
from langchain_mcp_adapters.tools import load_mcp_tools
from langchain.agents import create_agent

# Aponta pra URL — pode ser localhost ou um servidor remoto
async with streamablehttp_client(
    "http://localhost:8000/mcp"
) as (read, write):
    async with ClientSession(read, write) as session:
        await session.initialize()
        tools = await load_mcp_tools(session)
        agente = create_agent(llm, tools)
        # API idêntica — só muda como conecta
#+END_SRC

A API do agente é idêntica. A única diferença é *como* o cliente se conecta ao servidor: =stdio= spawn um processo local, =streamable-http= conecta a uma URL. Servidores MCP públicos (Slack, GitHub, Notion) funcionam assim — rodam remotamente e você só precisa da URL.

** S06 vs S07 — resumo

| Semana | Ferramentas | Origem | Código |
|--------|-------------|--------|--------|
| S06 | =@tool= — você escreve | Seu código Python =@tool= + =bind_tools= + =create_agent= |
| S07 | MCP — alguém escreveu | Servidor externo =load_mcp_tools= + =create_agent= |

O agente não sabe a diferença. Pra ele, ferramenta é ferramenta.

