pages/guilda-ia/07-ferramentas-multiplas.html
<div id="outline-container-org4550107" class="outline-2">
<h2 id="org4550107">Ferramentas externas via MCP</h2>
<div class="outline-text-2" id="text-org4550107">
<p>
Até agora, você escreveu as ferramentas. Mas e se <b>outra pessoa</b> escreveu a ferramenta e você só quer usar?
</p>

<p>
O <b><b>MCP</b></b> (Model Context Protocol) é um protocolo padrão para ferramentas. Pense nele como o HTTP das ferramentas de IA — assim como HTTP padronizou a web, MCP padroniza como ferramentas se conectam a agentes.
</p>
</div>
<div id="outline-container-org9afb35a" class="outline-3">
<h3 id="org9afb35a">Conceito</h3>
<div class="outline-text-3" id="text-org9afb35a">
<p>
<a href="https://modelcontextprotocol.io/">Model Context Protocol</a> (criado pela Anthropic, open-source):
</p>
<ul class="org-ul">
<li>Um <b>servidor MCP</b> expõe ferramentas</li>
<li>Um <b>cliente MCP</b> consome essas ferramentas</li>
<li>Protocolo padrão — qualquer LLM pode se conectar a qualquer servidor MCP</li>
</ul>

<p>
Na S06, você escreveu as ferramentas com <code>@tool</code>. Na S07, você <b>consome</b> ferramentas que alguém escreveu, via MCP.
</p>
</div>
</div>
<div id="outline-container-org6335f0c" class="outline-3">
<h3 id="org6335f0c">Servidor MCP com FastMCP</h3>
<div class="outline-text-3" id="text-org6335f0c">
<p>
Vamos criar um servidor MCP simples — depois vamos consumi-lo como cliente.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-comment-delimiter"># </span><span class="org-comment">math_server.py &#8212; Servidor MCP com duas ferramentas
</span><span class="org-keyword">from</span> mcp.server.fastmcp <span class="org-keyword">import</span> FastMCP

<span class="org-variable-name">mcp</span> <span class="org-operator">=</span> FastMCP(<span class="org-string">"Math"</span>)

<span class="org-type">@mcp.tool</span>()
<span class="org-keyword">def</span> <span class="org-function-name">add</span>(a: <span class="org-builtin">int</span>, b: <span class="org-builtin">int</span>) <span class="org-operator">-&gt;</span> <span class="org-builtin">int</span>:
    <span class="org-doc">"""Add two numbers together."""</span>
    <span class="org-keyword">return</span> a <span class="org-operator">+</span> b

<span class="org-type">@mcp.tool</span>()
<span class="org-keyword">def</span> <span class="org-function-name">multiply</span>(a: <span class="org-builtin">int</span>, b: <span class="org-builtin">int</span>) <span class="org-operator">-&gt;</span> <span class="org-builtin">int</span>:
    <span class="org-doc">"""Multiply two numbers together."""</span>
    <span class="org-keyword">return</span> a <span class="org-operator">*</span> b

<span class="org-keyword">if</span> <span class="org-builtin">__name__</span> <span class="org-operator">==</span> <span class="org-string">"__main__"</span>:
    mcp.run(transport<span class="org-operator">=</span><span class="org-string">"stdio"</span>)
</pre>
</div>

<p>
Repare: é quase idêntico ao <code>@tool</code> do LangChain, mas com <code>@mcp.tool()</code> e <code>FastMCP</code> em vez de <code>langchain_core.tools</code>.
</p>

<p>
O servidor usa <code>transport="stdio"</code> — roda no mesmo processo, sem servidor externo.
</p>
</div>
</div>
<div id="outline-container-org6ab1a6a" class="outline-3">
<h3 id="org6ab1a6a">Cliente: consumindo MCP no LangChain</h3>
<div class="outline-text-3" id="text-org6ab1a6a">
<p>
Instale: <code>pip install langchain-mcp-adapters</code>
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">from</span> mcp <span class="org-keyword">import</span> ClientSession, StdioServerParameters
<span class="org-keyword">from</span> mcp.client.stdio <span class="org-keyword">import</span> stdio_client
<span class="org-keyword">from</span> langchain_mcp_adapters.tools <span class="org-keyword">import</span> load_mcp_tools
<span class="org-keyword">from</span> langchain.agents <span class="org-keyword">import</span> create_agent

<span class="org-variable-name">server_params</span> <span class="org-operator">=</span> StdioServerParameters(
    command<span class="org-operator">=</span><span class="org-string">"python"</span>,
    args<span class="org-operator">=</span>[<span class="org-string">"math_server.py"</span>],
)

<span class="org-keyword">async with</span> stdio_client(server_params) <span class="org-keyword">as</span> (read, write):
    <span class="org-keyword">async with</span> ClientSession(read, write) <span class="org-keyword">as</span> session:
        <span class="org-keyword">await</span> session.initialize()
        <span class="org-variable-name">tools</span> <span class="org-operator">=</span> <span class="org-keyword">await</span> load_mcp_tools(session)
        <span class="org-comment-delimiter"># </span><span class="org-comment">tools agora s&#227;o @tool do LangChain &#8212; usa igual!
</span>        <span class="org-variable-name">agente</span> <span class="org-operator">=</span> create_agent(llm, tools)
        <span class="org-variable-name">resultado</span> <span class="org-operator">=</span> <span class="org-keyword">await</span> agente.ainvoke(
            {<span class="org-string">"messages"</span>: <span class="org-string">"Quanto &#233; 3 + 5 multiplicado por 2?"</span>}
        )
        <span class="org-builtin">print</span>(resultado[<span class="org-string">"messages"</span>][<span class="org-operator">-</span>1].content)
</pre>
</div>

<p>
O que aconteceu:
</p>
<ol class="org-ol">
<li><code>stdio_client</code> iniciou o servidor <code>math_server.py</code> em background</li>
<li><code>ClientSession</code> fez o handshake MCP</li>
<li><code>load_mcp_tools</code> converteu as ferramentas MCP em <code>@tool</code> do LangChain</li>
<li><code>create_agent</code> usou as ferramentas normalmente — igual à S06</li>
</ol>
</div>
</div>
<div id="outline-container-org1fd2003" class="outline-3">
<h3 id="org1fd2003">Servidor MCP remoto (HTTP)</h3>
<div class="outline-text-3" id="text-org1fd2003">
<p>
O exemplo acima usa <code>transport="stdio"</code> — o cliente spawn o servidor localmente. Mas o MCP também suporta transporte HTTP, permitindo conectar a servidores remotos.
</p>

<p>
Para rodar o mesmo servidor como HTTP:
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-comment-delimiter"># </span><span class="org-comment">math_server_http.py &#8212; Mesmo servidor, mas acess&#237;vel via HTTP
</span><span class="org-keyword">from</span> mcp.server.fastmcp <span class="org-keyword">import</span> FastMCP

<span class="org-variable-name">mcp</span> <span class="org-operator">=</span> FastMCP(<span class="org-string">"Math"</span>)

<span class="org-type">@mcp.tool</span>()
<span class="org-keyword">def</span> <span class="org-function-name">add</span>(a: <span class="org-builtin">int</span>, b: <span class="org-builtin">int</span>) <span class="org-operator">-&gt;</span> <span class="org-builtin">int</span>:
    <span class="org-doc">"""Add two numbers together."""</span>
    <span class="org-keyword">return</span> a <span class="org-operator">+</span> b

<span class="org-type">@mcp.tool</span>()
<span class="org-keyword">def</span> <span class="org-function-name">multiply</span>(a: <span class="org-builtin">int</span>, b: <span class="org-builtin">int</span>) <span class="org-operator">-&gt;</span> <span class="org-builtin">int</span>:
    <span class="org-doc">"""Multiply two numbers together."""</span>
    <span class="org-keyword">return</span> a <span class="org-operator">*</span> b

<span class="org-comment-delimiter"># </span><span class="org-comment">Roda em http://localhost:8000 (ou qualquer host remoto)
</span>mcp.run(transport<span class="org-operator">=</span><span class="org-string">"streamable-http"</span>)
</pre>
</div>

<p>
O código do servidor é idêntico — só muda a última linha. O servidor fica disponível em <code>http://localhost:8000/mcp</code> e pode ser acessado de qualquer máquina com conectividade.
</p>
</div>
</div>
<div id="outline-container-orgdbc86fe" class="outline-3">
<h3 id="orgdbc86fe">Cliente remoto (HTTP)</h3>
<div class="outline-text-3" id="text-orgdbc86fe">
<p>
No cliente, em vez de <code>stdio_client</code>, usamos <code>streamablehttp_client</code> com uma URL:
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">from</span> mcp <span class="org-keyword">import</span> ClientSession
<span class="org-keyword">from</span> mcp.client.streamable_http <span class="org-keyword">import</span> streamablehttp_client
<span class="org-keyword">from</span> langchain_mcp_adapters.tools <span class="org-keyword">import</span> load_mcp_tools
<span class="org-keyword">from</span> langchain.agents <span class="org-keyword">import</span> create_agent

<span class="org-comment-delimiter"># </span><span class="org-comment">Aponta pra URL &#8212; pode ser localhost ou um servidor remoto
</span><span class="org-keyword">async with</span> streamablehttp_client(
    <span class="org-string">"http://localhost:8000/mcp"</span>
) <span class="org-keyword">as</span> (read, write):
    <span class="org-keyword">async with</span> ClientSession(read, write) <span class="org-keyword">as</span> session:
        <span class="org-keyword">await</span> session.initialize()
        <span class="org-variable-name">tools</span> <span class="org-operator">=</span> <span class="org-keyword">await</span> load_mcp_tools(session)
        <span class="org-variable-name">agente</span> <span class="org-operator">=</span> create_agent(llm, tools)
        <span class="org-comment-delimiter"># </span><span class="org-comment">API id&#234;ntica &#8212; s&#243; muda como conecta</span>
</pre>
</div>

<p>
A API do agente é idêntica. A única diferença é <b>como</b> o cliente se conecta ao servidor: <code>stdio</code> spawn um processo local, <code>streamable-http</code> conecta a uma URL. Servidores MCP públicos (Slack, GitHub, Notion) funcionam assim — rodam remotamente e você só precisa da URL.
</p>
</div>
</div>
<div id="outline-container-org829199d" class="outline-3">
<h3 id="org829199d">S06 vs S07 — resumo</h3>
<div class="outline-text-3" id="text-org829199d">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Semana</th>
<th scope="col" class="org-left">Ferramentas</th>
<th scope="col" class="org-left">Origem</th>
<th scope="col" class="org-left">Código</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">S06</td>
<td class="org-left"><code>@tool</code> — você escreve</td>
<td class="org-left">Seu código Python <code>@tool</code> + <code>bind_tools</code> + <code>create_agent</code></td>
</tr>

<tr>
<td class="org-left">S07</td>
<td class="org-left">MCP — alguém escreveu</td>
<td class="org-left">Servidor externo <code>load_mcp_tools</code> + <code>create_agent</code></td>
</tr>
</tbody>
</table>

<p>
O agente não sabe a diferença. Pra ele, ferramenta é ferramenta.
</p>
</div>
</div>
</div>
