src/pages/guilda-ia/07-ferramentas-multiplas.org
* Múltiplos servidores MCP

Você pode conectar vários servidores MCP ao mesmo agente:

#+BEGIN_SRC python
from langchain_mcp_adapters.client import MultiServerMCPClient

client = MultiServerMCPClient({
    "math": {
        "command": "python",
        "args": ["math_server.py"],
        "transport": "stdio",
    },
    "weather": {
        "url": "http://localhost:8000/mcp",
        "transport": "http",
    }
})

tools = await client.get_tools()
agente = create_agent(llm, tools)
# Agora o agente tem ferramentas de math E weather
#+END_SRC

Isso é poderoso: você monta um agente combinando ferramentas de *fontes diferentes* sem escrever código de integração.

* Referências Importantes

** Paper: Gorilla

*Título:* "Gorilla: Large Language Model Connected to Massive APIs"
*Autores:* Shishir Patil, Tianjun Zhang, Xin Wang, Joseph E. Gonzalez
*Ano:* 2023
*Link:* [[https://arxiv.org/abs/2305.15334][arXiv:2305.15334]]

** Paper: ReAct

*Título:* "ReAct: Synergistic Reasoning and Acting in Language Models"
*Autores:* Shunyu Yao, et al.
*Ano:* 2022
*Link:* [[https://arxiv.org/abs/2210.03629][arXiv:2210.03629]]

** MCP — Model Context Protocol

*Site:* [[https://modelcontextprotocol.io/][modelcontextprotocol.io]]
*Biblioteca:* =langchain-mcp-adapters= v0.2.2 (MIT, Mar 2026)
*GitHub:* [[https://github.com/langchain-ai/langchain-mcp-adapters][langchain-ai/langchain-mcp-adapters]]

* Exercícios Práticos

** Exercício 1: Descrições em Conflito

Crie duas ferramentas com descrições parecidas e teste o que acontece. Depois, corrija as descrições e veja a diferença.

#+BEGIN_DETAILS
📝 Gabarito

#+BEGIN_SRC python
from langchain_core.tools import tool

# ❌ Descrições vagas — LLM confunde
@tool
def find_word_meaning(word: str) -> str:
    """Search for information about a word."""
    # (implementação simplificada)
    return f"Definition of {word}: ..."

@tool
def find_word_rhymes(word: str) -> str:
    """Search for information about a word."""
    # (implementação simplificada)
    return f"Rhymes of {word}: ..."

# Teste: "What does 'serendipity' mean?"
# Possível erro: LLM escolhe find_word_rhymes em vez de find_word_meaning

# ✅ Descrições específicas
@tool
def find_word_meaning(word: str) -> str:
    """Look up the definition and meaning of a word in a dictionary.
    Use when the user asks 'what does X mean' or 'definition of X'.
    """
    return f"Definition of {word}: ..."

@tool
def find_word_rhymes(word: str) -> str:
    """Find words that rhyme with a given word.
    Use when the user asks for rhymes, similar-sounding words, or poetry help.
    """
    return f"Rhymes of {word}: ..."
#+END_SRC

#+END_DETAILS

** Exercício 2: Debug de Descrição

O agente abaixo chama a ferramenta errada. Corrija a descrição.

#+BEGIN_SRC python
@tool
def calculate(a: float, b: float, operation: str) -> float:
    """Do math."""
    ops = {'add': a+b, 'subtract': a-b,
           'multiply': a*b, 'divide': a/b}
    return ops[operation]

@tool
def get_time() -> str:
    """Gives info."""
    from datetime import datetime
    return datetime.now().strftime("%d/%m/%Y %H:%M:%S")

# Teste: "Que horas são?"
# Resultado: LLM chama calculate em vez de get_time
# Por quê? "Gives info" e "Do math" são vagas demais
#+END_SRC

#+BEGIN_DETAILS
📝 Gabarito

#+BEGIN_SRC python
@tool
def calculate(a: float, b: float, operation: str) -> float:
    """Performs a mathematical operation between two numbers.
    Use when you need to perform numeric calculations like addition,
    subtraction, multiplication, or division.
    Args:
        a: First number
        b: Second number
        operation: One of 'add', 'subtract', 'multiply', 'divide'
    """
    ops = {'add': a+b, 'subtract': a-b,
           'multiply': a*b, 'divide': a/b}
    return ops[operation]

@tool
def get_time() -> str:
    """Returns the current date and time.
    Use when the user asks about the current time, today's date,
    or 'what time is it'.
    """
    from datetime import datetime
    return datetime.now().strftime("%d/%m/%Y %H:%M:%S")
#+END_SRC

#+END_DETAILS

