pages/guilda-ia/07-ferramentas-multiplas.html
<div id="outline-container-org066d941" class="outline-2">
<h2 id="org066d941">Múltiplos servidores MCP</h2>
<div class="outline-text-2" id="text-org066d941">
<p>
Você pode conectar vários servidores MCP ao mesmo agente:
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">from</span> langchain_mcp_adapters.client <span class="org-keyword">import</span> MultiServerMCPClient

<span class="org-variable-name">client</span> <span class="org-operator">=</span> MultiServerMCPClient({
    <span class="org-string">"math"</span>: {
        <span class="org-string">"command"</span>: <span class="org-string">"python"</span>,
        <span class="org-string">"args"</span>: [<span class="org-string">"math_server.py"</span>],
        <span class="org-string">"transport"</span>: <span class="org-string">"stdio"</span>,
    },
    <span class="org-string">"weather"</span>: {
        <span class="org-string">"url"</span>: <span class="org-string">"http://localhost:8000/mcp"</span>,
        <span class="org-string">"transport"</span>: <span class="org-string">"http"</span>,
    }
})

<span class="org-variable-name">tools</span> <span class="org-operator">=</span> <span class="org-keyword">await</span> client.get_tools()
<span class="org-variable-name">agente</span> <span class="org-operator">=</span> create_agent(llm, tools)
<span class="org-comment-delimiter"># </span><span class="org-comment">Agora o agente tem ferramentas de math E weather</span>
</pre>
</div>

<p>
Isso é poderoso: você monta um agente combinando ferramentas de <b>fontes diferentes</b> sem escrever código de integração.
</p>
</div>
</div>
<div id="outline-container-orgb64456f" class="outline-2">
<h2 id="orgb64456f">Referências Importantes</h2>
<div class="outline-text-2" id="text-orgb64456f">
</div>
<div id="outline-container-org5249501" class="outline-3">
<h3 id="org5249501">Paper: Gorilla</h3>
<div class="outline-text-3" id="text-org5249501">
<p>
<b>Título:</b> "Gorilla: Large Language Model Connected to Massive APIs"
<b>Autores:</b> Shishir Patil, Tianjun Zhang, Xin Wang, Joseph E. Gonzalez
<b>Ano:</b> 2023
<b>Link:</b> <a href="https://arxiv.org/abs/2305.15334">arXiv:2305.15334</a>
</p>
</div>
</div>
<div id="outline-container-org51aa00c" class="outline-3">
<h3 id="org51aa00c">Paper: ReAct</h3>
<div class="outline-text-3" id="text-org51aa00c">
<p>
<b>Título:</b> "ReAct: Synergistic Reasoning and Acting in Language Models"
<b>Autores:</b> Shunyu Yao, et al.
<b>Ano:</b> 2022
<b>Link:</b> <a href="https://arxiv.org/abs/2210.03629">arXiv:2210.03629</a>
</p>
</div>
</div>
<div id="outline-container-orgc011fdd" class="outline-3">
<h3 id="orgc011fdd">MCP — Model Context Protocol</h3>
<div class="outline-text-3" id="text-orgc011fdd">
<p>
<b>Site:</b> <a href="https://modelcontextprotocol.io/">modelcontextprotocol.io</a>
<b>Biblioteca:</b> <code>langchain-mcp-adapters</code> v0.2.2 (MIT, Mar 2026)
<b>GitHub:</b> <a href="https://github.com/langchain-ai/langchain-mcp-adapters">langchain-ai/langchain-mcp-adapters</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org4317f10" class="outline-2">
<h2 id="org4317f10">Exercícios Práticos</h2>
<div class="outline-text-2" id="text-org4317f10">
</div>
<div id="outline-container-orge9077ed" class="outline-3">
<h3 id="orge9077ed">Exercício 1: Descrições em Conflito</h3>
<div class="outline-text-3" id="text-orge9077ed">
<p>
Crie duas ferramentas com descrições parecidas e teste o que acontece. Depois, corrija as descrições e veja a diferença.
</p>

<div class="DETAILS" id="orgd999ca2">
<p>
📝 Gabarito
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">from</span> langchain_core.tools <span class="org-keyword">import</span> tool

<span class="org-comment-delimiter"># </span><span class="org-comment">&#10060; Descri&#231;&#245;es vagas &#8212; LLM confunde
</span><span class="org-type">@tool</span>
<span class="org-keyword">def</span> <span class="org-function-name">find_word_meaning</span>(word: <span class="org-builtin">str</span>) <span class="org-operator">-&gt;</span> <span class="org-builtin">str</span>:
    <span class="org-doc">"""Search for information about a word."""</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">(implementa&#231;&#227;o simplificada)
</span>    <span class="org-keyword">return</span> f<span class="org-string">"Definition of </span>{word}<span class="org-string">: ..."</span>

<span class="org-type">@tool</span>
<span class="org-keyword">def</span> <span class="org-function-name">find_word_rhymes</span>(word: <span class="org-builtin">str</span>) <span class="org-operator">-&gt;</span> <span class="org-builtin">str</span>:
    <span class="org-doc">"""Search for information about a word."""</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">(implementa&#231;&#227;o simplificada)
</span>    <span class="org-keyword">return</span> f<span class="org-string">"Rhymes of </span>{word}<span class="org-string">: ..."</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Teste: "What does 'serendipity' mean?"
</span><span class="org-comment-delimiter"># </span><span class="org-comment">Poss&#237;vel erro: LLM escolhe find_word_rhymes em vez de find_word_meaning
</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">&#9989; Descri&#231;&#245;es espec&#237;ficas
</span><span class="org-type">@tool</span>
<span class="org-keyword">def</span> <span class="org-function-name">find_word_meaning</span>(word: <span class="org-builtin">str</span>) <span class="org-operator">-&gt;</span> <span class="org-builtin">str</span>:
    <span class="org-doc">"""Look up the definition and meaning of a word in a dictionary.
    Use when the user asks 'what does X mean' or 'definition of X'.
    """</span>
    <span class="org-keyword">return</span> f<span class="org-string">"Definition of </span>{word}<span class="org-string">: ..."</span>

<span class="org-type">@tool</span>
<span class="org-keyword">def</span> <span class="org-function-name">find_word_rhymes</span>(word: <span class="org-builtin">str</span>) <span class="org-operator">-&gt;</span> <span class="org-builtin">str</span>:
    <span class="org-doc">"""Find words that rhyme with a given word.
    Use when the user asks for rhymes, similar-sounding words, or poetry help.
    """</span>
    <span class="org-keyword">return</span> f<span class="org-string">"Rhymes of </span>{word}<span class="org-string">: ..."</span>
</pre>
</div>

</div>
</div>
</div>
<div id="outline-container-org0e2616a" class="outline-3">
<h3 id="org0e2616a">Exercício 2: Debug de Descrição</h3>
<div class="outline-text-3" id="text-org0e2616a">
<p>
O agente abaixo chama a ferramenta errada. Corrija a descrição.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-type">@tool</span>
<span class="org-keyword">def</span> <span class="org-function-name">calculate</span>(a: <span class="org-builtin">float</span>, b: <span class="org-builtin">float</span>, operation: <span class="org-builtin">str</span>) <span class="org-operator">-&gt;</span> <span class="org-builtin">float</span>:
    <span class="org-doc">"""Do math."""</span>
    <span class="org-variable-name">ops</span> <span class="org-operator">=</span> {<span class="org-string">'add'</span>: a<span class="org-operator">+</span>b, <span class="org-string">'subtract'</span>: a<span class="org-operator">-</span>b,
           <span class="org-string">'multiply'</span>: a<span class="org-operator">*</span>b, <span class="org-string">'divide'</span>: a<span class="org-operator">/</span>b}
    <span class="org-keyword">return</span> ops[operation]

<span class="org-type">@tool</span>
<span class="org-keyword">def</span> <span class="org-function-name">get_time</span>() <span class="org-operator">-&gt;</span> <span class="org-builtin">str</span>:
    <span class="org-doc">"""Gives info."""</span>
    <span class="org-keyword">from</span> datetime <span class="org-keyword">import</span> datetime
    <span class="org-keyword">return</span> datetime.now().strftime(<span class="org-string">"%d/%m/%Y %H:%M:%S"</span>)

<span class="org-comment-delimiter"># </span><span class="org-comment">Teste: "Que horas s&#227;o?"
</span><span class="org-comment-delimiter"># </span><span class="org-comment">Resultado: LLM chama calculate em vez de get_time
</span><span class="org-comment-delimiter"># </span><span class="org-comment">Por qu&#234;? "Gives info" e "Do math" s&#227;o vagas demais</span>
</pre>
</div>

<div class="DETAILS" id="org78b01d6">
<p>
📝 Gabarito
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-type">@tool</span>
<span class="org-keyword">def</span> <span class="org-function-name">calculate</span>(a: <span class="org-builtin">float</span>, b: <span class="org-builtin">float</span>, operation: <span class="org-builtin">str</span>) <span class="org-operator">-&gt;</span> <span class="org-builtin">float</span>:
    <span class="org-doc">"""Performs a mathematical operation between two numbers.
    Use when you need to perform numeric calculations like addition,
    subtraction, multiplication, or division.
    Args:
        a: First number
        b: Second number
        operation: One of 'add', 'subtract', 'multiply', 'divide'
    """</span>
    <span class="org-variable-name">ops</span> <span class="org-operator">=</span> {<span class="org-string">'add'</span>: a<span class="org-operator">+</span>b, <span class="org-string">'subtract'</span>: a<span class="org-operator">-</span>b,
           <span class="org-string">'multiply'</span>: a<span class="org-operator">*</span>b, <span class="org-string">'divide'</span>: a<span class="org-operator">/</span>b}
    <span class="org-keyword">return</span> ops[operation]

<span class="org-type">@tool</span>
<span class="org-keyword">def</span> <span class="org-function-name">get_time</span>() <span class="org-operator">-&gt;</span> <span class="org-builtin">str</span>:
    <span class="org-doc">"""Returns the current date and time.
    Use when the user asks about the current time, today's date,
    or 'what time is it'.
    """</span>
    <span class="org-keyword">from</span> datetime <span class="org-keyword">import</span> datetime
    <span class="org-keyword">return</span> datetime.now().strftime(<span class="org-string">"%d/%m/%Y %H:%M:%S"</span>)
</pre>
</div>

</div>
</div>
</div>
