src/pages/guilda-ia/07-ferramentas-multiplas.org
** Exercício 3: Servidor MCP

Crie um servidor MCP com uma ferramenta =reverse_string= que inverte uma string, depois escreva um cliente que a consome.

#+BEGIN_DETAILS
📝 Gabarito

Servidor (=reverse_server.py=):

#+BEGIN_SRC python
from mcp.server.fastmcp import FastMCP

mcp = FastMCP("Reverse")

@mcp.tool()
def reverse_string(text: str) -> str:
    """Reverses a string. Use when the user wants to flip or reverse text."""
    return text[::-1]

if __name__ == "__main__":
    mcp.run(transport="stdio")
#+END_SRC

Cliente (Colab):

#+BEGIN_SRC python
from mcp import ClientSession, StdioServerParameters
from mcp.client.stdio import stdio_client
from langchain_mcp_adapters.tools import load_mcp_tools
from langchain.agents import create_agent
from langchain_openai import ChatOpenAI

llm = ChatOpenAI(
    model="lfm2.5:8b",
    base_url="http://localhost:11434/v1",
    api_key="nao_precisa",
    temperature=0,
)

server_params = StdioServerParameters(
    command="python",
    args=["reverse_server.py"],
)

async with stdio_client(server_params) as (read, write):
    async with ClientSession(read, write) as session:
        await session.initialize()
        tools = await load_mcp_tools(session)
        agente = create_agent(llm, tools)
        resultado = await agente.ainvoke(
            {"messages": "Reverse the word 'Guilda'"}
        )
        print(resultado["messages"][-1].content)
        # "The reverse of 'Guilda' is 'adliuG'."
#+END_SRC

#+END_DETAILS

** Exercício 4: Agente com Ferramentas Mistas

Combine duas ferramentas =@tool= (que você escreveu) com ferramentas MCP de um servidor externo em um único agente.

#+BEGIN_DETAILS
📝 Gabarito

#+BEGIN_SRC python
from langchain_core.tools import tool
from langchain.agents import create_agent
from langchain_mcp_adapters.client import MultiServerMCPClient

# Suas ferramentas @tool
@tool
def calculate(a: float, b: float, operation: str) -> float:
    """Performs a mathematical operation between two numbers.
    Args:
        a: First number
        b: Second number
        operation: One of 'add', 'subtract', 'multiply', 'divide'
    """
    ops = {'add': a+b, 'subtract': a-b,
           'multiply': a*b, 'divide': a/b}
    return ops[operation]

# Ferramentas MCP
client = MultiServerMCPClient({
    "math": {
        "command": "python",
        "args": ["math_server.py"],
        "transport": "stdio",
    },
})

mcp_tools = await client.get_tools()

# Combina tudo
all_tools = [calculate] + mcp_tools
agente = create_agent(llm, all_tools)

resultado = await agente.ainvoke(
    {"messages": "Quanto é 10 + 5 multiplicado por 3?"}
)
print(resultado["messages"][-1].content)
#+END_SRC

#+END_DETAILS