pages/guilda-ia/07-ferramentas-multiplas.html
<div id="outline-container-orgd44e19a" class="outline-3">
<h3 id="orgd44e19a">Exercício 3: Servidor MCP</h3>
<div class="outline-text-3" id="text-orgd44e19a">
<p>
Crie um servidor MCP com uma ferramenta <code>reverse_string</code> que inverte uma string, depois escreva um cliente que a consome.
</p>

<div class="DETAILS" id="org728bc04">
<p>
📝 Gabarito
</p>

<p>
Servidor (<code>reverse_server.py</code>):
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">from</span> mcp.server.fastmcp <span class="org-keyword">import</span> FastMCP

<span class="org-variable-name">mcp</span> <span class="org-operator">=</span> FastMCP(<span class="org-string">"Reverse"</span>)

<span class="org-type">@mcp.tool</span>()
<span class="org-keyword">def</span> <span class="org-function-name">reverse_string</span>(text: <span class="org-builtin">str</span>) <span class="org-operator">-&gt;</span> <span class="org-builtin">str</span>:
    <span class="org-doc">"""Reverses a string. Use when the user wants to flip or reverse text."""</span>
    <span class="org-keyword">return</span> text[::<span class="org-operator">-</span>1]

<span class="org-keyword">if</span> <span class="org-builtin">__name__</span> <span class="org-operator">==</span> <span class="org-string">"__main__"</span>:
    mcp.run(transport<span class="org-operator">=</span><span class="org-string">"stdio"</span>)
</pre>
</div>

<p>
Cliente (Colab):
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">from</span> mcp <span class="org-keyword">import</span> ClientSession, StdioServerParameters
<span class="org-keyword">from</span> mcp.client.stdio <span class="org-keyword">import</span> stdio_client
<span class="org-keyword">from</span> langchain_mcp_adapters.tools <span class="org-keyword">import</span> load_mcp_tools
<span class="org-keyword">from</span> langchain.agents <span class="org-keyword">import</span> create_agent
<span class="org-keyword">from</span> langchain_openai <span class="org-keyword">import</span> ChatOpenAI

<span class="org-variable-name">llm</span> <span class="org-operator">=</span> ChatOpenAI(
    model<span class="org-operator">=</span><span class="org-string">"lfm2.5:8b"</span>,
    base_url<span class="org-operator">=</span><span class="org-string">"http://localhost:11434/v1"</span>,
    api_key<span class="org-operator">=</span><span class="org-string">"nao_precisa"</span>,
    temperature<span class="org-operator">=</span>0,
)

<span class="org-variable-name">server_params</span> <span class="org-operator">=</span> StdioServerParameters(
    command<span class="org-operator">=</span><span class="org-string">"python"</span>,
    args<span class="org-operator">=</span>[<span class="org-string">"reverse_server.py"</span>],
)

<span class="org-keyword">async with</span> stdio_client(server_params) <span class="org-keyword">as</span> (read, write):
    <span class="org-keyword">async with</span> ClientSession(read, write) <span class="org-keyword">as</span> session:
        <span class="org-keyword">await</span> session.initialize()
        <span class="org-variable-name">tools</span> <span class="org-operator">=</span> <span class="org-keyword">await</span> load_mcp_tools(session)
        <span class="org-variable-name">agente</span> <span class="org-operator">=</span> create_agent(llm, tools)
        <span class="org-variable-name">resultado</span> <span class="org-operator">=</span> <span class="org-keyword">await</span> agente.ainvoke(
            {<span class="org-string">"messages"</span>: <span class="org-string">"Reverse the word 'Guilda'"</span>}
        )
        <span class="org-builtin">print</span>(resultado[<span class="org-string">"messages"</span>][<span class="org-operator">-</span>1].content)
        <span class="org-comment-delimiter"># </span><span class="org-comment">"The reverse of 'Guilda' is 'adliuG'."</span>
</pre>
</div>

</div>
</div>
</div>
<div id="outline-container-org3e93e49" class="outline-3">
<h3 id="org3e93e49">Exercício 4: Agente com Ferramentas Mistas</h3>
<div class="outline-text-3" id="text-org3e93e49">
<p>
Combine duas ferramentas <code>@tool</code> (que você escreveu) com ferramentas MCP de um servidor externo em um único agente.
</p>

<div class="DETAILS" id="org268ff57">
<p>
📝 Gabarito
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">from</span> langchain_core.tools <span class="org-keyword">import</span> tool
<span class="org-keyword">from</span> langchain.agents <span class="org-keyword">import</span> create_agent
<span class="org-keyword">from</span> langchain_mcp_adapters.client <span class="org-keyword">import</span> MultiServerMCPClient

<span class="org-comment-delimiter"># </span><span class="org-comment">Suas ferramentas @tool
</span><span class="org-type">@tool</span>
<span class="org-keyword">def</span> <span class="org-function-name">calculate</span>(a: <span class="org-builtin">float</span>, b: <span class="org-builtin">float</span>, operation: <span class="org-builtin">str</span>) <span class="org-operator">-&gt;</span> <span class="org-builtin">float</span>:
    <span class="org-doc">"""Performs a mathematical operation between two numbers.
    Args:
        a: First number
        b: Second number
        operation: One of 'add', 'subtract', 'multiply', 'divide'
    """</span>
    <span class="org-variable-name">ops</span> <span class="org-operator">=</span> {<span class="org-string">'add'</span>: a<span class="org-operator">+</span>b, <span class="org-string">'subtract'</span>: a<span class="org-operator">-</span>b,
           <span class="org-string">'multiply'</span>: a<span class="org-operator">*</span>b, <span class="org-string">'divide'</span>: a<span class="org-operator">/</span>b}
    <span class="org-keyword">return</span> ops[operation]

<span class="org-comment-delimiter"># </span><span class="org-comment">Ferramentas MCP
</span><span class="org-variable-name">client</span> <span class="org-operator">=</span> MultiServerMCPClient({
    <span class="org-string">"math"</span>: {
        <span class="org-string">"command"</span>: <span class="org-string">"python"</span>,
        <span class="org-string">"args"</span>: [<span class="org-string">"math_server.py"</span>],
        <span class="org-string">"transport"</span>: <span class="org-string">"stdio"</span>,
    },
})

<span class="org-variable-name">mcp_tools</span> <span class="org-operator">=</span> <span class="org-keyword">await</span> client.get_tools()

<span class="org-comment-delimiter"># </span><span class="org-comment">Combina tudo
</span><span class="org-variable-name">all_tools</span> <span class="org-operator">=</span> [calculate] <span class="org-operator">+</span> mcp_tools
<span class="org-variable-name">agente</span> <span class="org-operator">=</span> create_agent(llm, all_tools)

<span class="org-variable-name">resultado</span> <span class="org-operator">=</span> <span class="org-keyword">await</span> agente.ainvoke(
    {<span class="org-string">"messages"</span>: <span class="org-string">"Quanto &#233; 10 + 5 multiplicado por 3?"</span>}
)
<span class="org-builtin">print</span>(resultado[<span class="org-string">"messages"</span>][<span class="org-operator">-</span>1].content)
</pre>
</div>

</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<h3><a href="/pages/guilda-ia/">&#8592; Voltar para Guilda de IA</a></h3>
</div>
</body>
</html>
